# HasViewportTransforms Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..HasViewportTransforms Method
Viewport Class See Also
---
Indicates if the viewport has transforms.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool HasViewportTransforms()
```

Visual Basic
---
```text
Public Function HasViewportTransforms As Boolean
```

Visual C++
---
```text
public:
bool HasViewportTransforms()
```

# ### Return Value
True if the viewport has transforms, false otherwise.
# Remarks
Not all viewports have transforms. For example, viewports for schedules and legends do not have transforms.
# See Also
Viewport Class
Autodesk.Revit.DB Namespace